# Python Foundation: 

> 1. Type conversion functions:
    - Datetime
    - int/float
    - object
    
> 2. Plots/Graphs in python
    - Using pandas plot
    - Using pyplot from matplotlib
    - Using seaborn
    - --------------------------------------
    - plotnine/ggplot
    - Bokeh
    - plotly

In [1]:
import pandas as pd

In [2]:
stores=pd.read_csv('Data Sets/stores.csv')

In [3]:
Q1 = pd.read_csv('Data Sets/POS_Q1.csv')

### map / apply / applymap
> 1. map: works on each element of series
> 2. applymap: works on each element within a dataframe
> 3. apply works on series or individual item depending on its use

In [4]:
# convert Location variable from stores dataset into upper case (map)

# convert Store type and Location variables from stores dataset into upper case (applymap)

# convert all object variables from stores dataset into upper case (applymap)

# get the sum of all numerical variables from stores dataset

# create a UDF that takes series as an input and return stats summary of data for int variables (.describe function)

In [5]:
stores.head()

,StoreCode,StoreName,StoreType,Location,OperatingCost,Staff_Cnt,TotalSales,Total_Customers,AcqCostPercust,BasketSize,ProfitPercust,OwnStore,OnlinePresence,Tenure,StoreSegment
0,STR101,Electronics Zone,Electronincs,Delhi,21.0,60,160.0,110,3.90,2.620,16.46,0,1,4,4
1,STR102,Apparel Zone,Apparel,Delhi,21.0,60,160.0,110,3.90,2.875,17.02,0,1,4,4
2,STR103,Super Bazar,Super Market,Delhi,22.8,40,108.0,93,3.85,2.320,18.61,1,1,4,1
3,STR104,Super Market,Super Market,Delhi,21.4,60,258.0,110,3.08,3.215,19.44,1,0,3,1
4,STR105,Central Store,Super Market,Delhi,18.7,80,360.0,175,3.15,3.440,17.02,0,0,3,2

In [6]:
# convert Location variable from stores dataset into upper case (map)
pd.Series(map(lambda x: x.upper(), stores.Location))

0       DELHI
1       DELHI
2       DELHI
3       DELHI
4       DELHI
5       DELHI
6       DELHI
7       DELHI
8     CHENNAI
9     CHENNAI
10    CHENNAI
11    CHENNAI
12    CHENNAI
13    CHENNAI
14    CHENNAI
15    CHENNAI
16     MUMBAI
17     MUMBAI
18     MUMBAI
19     MUMBAI
20     MUMBAI
21     MUMBAI
22     MUMBAI
23     MUMBAI
24    KOLKATA
25    KOLKATA
26    KOLKATA
27    KOLKATA
28    KOLKATA
29    KOLKATA
30    KOLKATA
31    KOLKATA
dtype: object

In [14]:
stores_flt=stores.loc[:,stores.dtypes=='float64']
print(stores_flt.apply(sum,axis=0))
print(stores_flt.apply(sum,axis=1))
#stores.apply(sum)
#stores_flt.apply?

OperatingCost      642.900
TotalSales        7383.100
AcqCostPercust         NaN
BasketSize         102.952
ProfitPercust      571.160
dtype: float64
0     203.980
1     204.795
2     155.580
3     305.135
4     402.310
5     269.540
6     396.920
7     197.980
8     193.570
9     212.460
10    211.660
11        NaN
12        NaN
13        NaN
14    508.560
15    496.644
16    480.695
17    136.850
18    131.165
19    130.955
20    167.775
21    356.650
22    343.085
23    386.280
24    443.175
25    131.215
26    169.570
27    147.683
28    388.690
29    186.590
30    337.710
31    167.890
dtype: float64

In [18]:
stores[['Location','StoreType']].applymap(lambda x: x.upper())

   Location     StoreType
0     DELHI  ELECTRONINCS
1     DELHI       APPAREL
2     DELHI  SUPER MARKET
3     DELHI  SUPER MARKET
4     DELHI  SUPER MARKET
5     DELHI       APPAREL
6     DELHI       APPAREL
7     DELHI  ELECTRONINCS
8   CHENNAI  ELECTRONINCS
9   CHENNAI       APPAREL
10  CHENNAI  SUPER MARKET
11  CHENNAI  SUPER MARKET
12  CHENNAI  SUPER MARKET
13  CHENNAI       APPAREL
14  CHENNAI       APPAREL
15  CHENNAI  ELECTRONINCS
16   MUMBAI  ELECTRONINCS
17   MUMBAI       APPAREL
18   MUMBAI  SUPER MARKET
19   MUMBAI  SUPER MARKET
20   MUMBAI  SUPER MARKET
21   MUMBAI       APPAREL
22   MUMBAI       APPAREL
23   MUMBAI  ELECTRONINCS
24  KOLKATA  ELECTRONINCS
25  KOLKATA       APPAREL
26  KOLKATA  SUPER MARKET
27  KOLKATA  SUPER MARKET
28  KOLKATA  SUPER MARKET
29  KOLKATA       APPAREL
30  KOLKATA       APPAREL
31  KOLKATA  ELECTRONINCS

In [20]:
# convert all object variables from stores dataset into upper case
stores.loc[:, stores.dtypes == 'object'].applymap(lambda x: x.upper())

   StoreCode         StoreName     StoreType Location
0     STR101  ELECTRONICS ZONE  ELECTRONINCS    DELHI
1     STR102      APPAREL ZONE       APPAREL    DELHI
2     STR103       SUPER BAZAR  SUPER MARKET    DELHI
3     STR104      SUPER MARKET  SUPER MARKET    DELHI
4     STR105     CENTRAL STORE  SUPER MARKET    DELHI
5     STR106      APPAREL ZONE       APPAREL    DELHI
6     STR107     FASHION BAZAR       APPAREL    DELHI
7     STR108     DIGITAL BAZAR  ELECTRONINCS    DELHI
8     STR109  ELECTRONICS ZONE  ELECTRONINCS  CHENNAI
9     STR110      APPAREL ZONE       APPAREL  CHENNAI
10    STR111       SUPER BAZAR  SUPER MARKET  CHENNAI
11    STR112      SUPER MARKET  SUPER MARKET  CHENNAI
12    STR113     CENTRAL STORE  SUPER MARKET  CHENNAI
13    STR114      APPAREL ZONE       APPAREL  CHENNAI
14    STR115     FASHION BAZAR       APPAREL  CHENNAI
15    STR116     DIGITAL BAZAR  ELECTRONINCS  CHENNAI
16    STR117  ELECTRONICS ZONE  ELECTRONINCS   MUMBAI
17    STR118      APPAREL ZONE       APPAREL   MUMBAI
18    STR119       SUPER BAZAR  SUPER MARKET   MUMBAI
19    STR120      SUPER MARKET  SUPER MARKET   MUMBAI
20    STR121     CENTRAL STORE  SUPER MARKET   MUMBAI
21    STR122      APPAREL ZONE       APPAREL   MUMBAI
22    STR123     FASHION BAZAR       APPAREL   MUMBAI
23    STR124     DIGITAL BAZAR  ELECTRONINCS   MUMBAI
24    STR125  ELECTRONICS ZONE  ELECTRONINCS  KOLKATA
25    STR126      APPAREL ZONE       APPAREL  KOLKATA
26    STR127       SUPER BAZAR  SUPER MARKET  KOLKATA
27    STR128      SUPER MARKET  SUPER MARKET  KOLKATA
28    STR129     CENTRAL STORE  SUPER MARKET  KOLKATA
29    STR130      APPAREL ZONE       APPAREL  KOLKATA
30    STR131     FASHION BAZAR       APPAREL  KOLKATA
31    STR132     DIGITAL BAZAR  ELECTRONINCS  KOLKATA

In [21]:
# get the sum of all numerical variables from stores dataset
stores.loc[:, stores.dtypes == 'int64'].apply(sum)

Staff_Cnt          1980
Total_Customers    4694
OwnStore             14
OnlinePresence       13
Tenure              118
StoreSegment         84
dtype: int64

In [22]:
import pandas as pd
stores = pd.read_csv('Data Sets/stores.csv', sep = ',')

In [27]:
# describe function
def summ_stats(x):
    return pd.Series([x.count(), x.isnull().sum(), x.sum(), x.mean(), x.median(), x.std(), x.var(), x.min(), 
                          x.dropna().quantile(0.01), x.dropna().quantile(0.05), x.dropna().quantile(0.10), 
                              x.dropna().quantile(0.25), x.dropna().quantile(0.50), x.dropna().quantile(0.75), 
                                  x.dropna().quantile(0.90),x.dropna().quantile(0.95), x.dropna().quantile(0.99),x.max()], 
                  index=['N', 'NMISS', 'SUM', 'MEAN','MEDIAN', 'STD', 'VAR', 'MIN', 'P1' , 'P5' ,'P10' ,'P25' ,'P50' ,
                             'P75' ,'P90' ,'P95' ,'P99' ,'MAX'])

In [28]:
stores.loc[:, stores.dtypes == 'int64'].apply(summ_stats)

,Staff_Cnt,Total_Customers,OwnStore,OnlinePresence,Tenure,StoreSegment
N,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000
NMISS,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
SUM,1980.000000,4694.000000,14.000000,13.000000,118.000000,84.000000
MEAN,61.875000,146.687500,0.437500,0.406250,3.687500,2.625000
MEDIAN,60.000000,123.000000,0.000000,0.000000,4.000000,2.000000
STD,17.859216,68.562868,0.504016,0.498991,0.737804,1.211504
VAR,318.951613,4700.866935,0.254032,0.248992,0.544355,1.467742
MIN,40.000000,52.000000,0.000000,0.000000,3.000000,1.000000
P1,40.000000,55.100000,0.000000,0.000000,3.000000,1.000000
P5,40.000000,63.650000,0.000000,0.000000,3.000000,1.000000
P10,40.000000,66.000000,0.000000,0.000000,3.000000,1.000000
P25,40.000000,96.500000,0.000000,0.000000,3.000000,2.000000
P50,60.000000,123.000000,0.000000,0.000000,4.000000,2.000000
P75,80.000000,180.000000,1.000000,1.000000,4.000000,4.000000
P90,80.000000,243.500000,1.000000,1.000000,5.000000,4.000000
P95,80.000000,253.550000,1.000000,1.000000,5.000000,4.000000
P99,80.000000,312.990000,1.000000,1.000000,5.000000,4.000000
MAX,80.000000,335.000000,1.000000,1.000000,5.000000,4.000000

### DateTime Operations

# in pandas
pd.to_datetime()
pd.to_numeric()
series.astype()

In [29]:
Q1.head()

,Date,Configuration,Customer Postcode,Store Postcode,Retail Price,month
0,01-01-13 0:01,163,EC4V 5BH,SE1 2BN,455,1
1,01-01-13 0:02,320,SW4 0JL,SW12 9HD,545,1
2,01-01-13 0:04,23,EC3V 1LR,E2 0RY,515,1
3,01-01-13 0:04,169,SW1P 3AU,SE1 2BN,395,1
4,01-01-13 0:06,365,EC4V 4EG,SW1V 4QQ,585,1

In [30]:
Q1.Date

0    01-01-13 0:01
1    01-01-13 0:02
2    01-01-13 0:04
3    01-01-13 0:04
4    01-01-13 0:06
Name: Date, dtype: object

In [31]:
pd.to_datetime(Q1.Date)

0   2013-01-01 00:01:00
1   2013-01-01 00:02:00
2   2013-01-01 00:04:00
3   2013-01-01 00:04:00
4   2013-01-01 00:06:00
Name: Date, dtype: datetime64[ns]

pd.to_numeric()
pd.to_datetime()
    date      : %d
    day abb   : %a
    day       : %A
    month     : %m
    month abb : %b
    month     : %B
    year w/o c: %y
    year w c  : %Y
    hours 24  : %H
    hours 12  : %I
    minutes   : %M
    seconds   : %S
    am/pm     : %p
df.astype(str)

In [32]:
dob = '07-04-2000'    #mm-dd-yyyy
type(dob)

str

In [33]:
# convert following dates in to datetime
d1 = pd.Series(['23-09-2012', '03-09-2019'])
d2 = pd.Series(['12:45:55 pm 02232002', '11:40:55 pm 06022002', '12:04:55 am 10302002'])

In [35]:
# series 1
pd.to_datetime(d1, format='%d-%m-%Y')

0   2012-09-23
1   2019-09-03
dtype: datetime64[ns]

In [38]:
# series 2
pd.to_datetime(d2, format = '%I:%M:%S %p %m%d%Y')

#pd.to_datetime?

0   2002-02-23 12:45:55
1   2002-06-02 23:40:55
2   2002-10-30 00:04:55
dtype: datetime64[ns]

23-07-2019
07/20/2018
23-07-2019
07/20/2018
02-Aug-2019

In [39]:
d3 = pd.Series(['34', '54.4', '66'])

In [40]:
pd.to_numeric(d3) + 100

0    134.0
1    154.4
2    166.0
dtype: float64

In [42]:
Q1.Configuration.astype('category')

0    163
1    320
2     23
3    169
4    365
Name: Configuration, dtype: category
Categories (5, int64): [23, 163, 169, 320, 365]

In [43]:
from datetime import datetime as dt

In [44]:
print(dir(dt))

['__add__', '__class__', '__delattr__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__ne__', '__new__', '__radd__', '__reduce__', '__reduce_ex__', '__repr__', '__rsub__', '__setattr__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', 'astimezone', 'combine', 'ctime', 'date', 'day', 'dst', 'fold', 'fromisoformat', 'fromordinal', 'fromtimestamp', 'hour', 'isocalendar', 'isoformat', 'isoweekday', 'max', 'microsecond', 'min', 'minute', 'month', 'now', 'replace', 'resolution', 'second', 'strftime', 'strptime', 'time', 'timestamp', 'timetuple', 'timetz', 'today', 'toordinal', 'tzinfo', 'tzname', 'utcfromtimestamp', 'utcnow', 'utcoffset', 'utctimetuple', 'weekday', 'year']

In [45]:
dt.today()

datetime.datetime(2021, 10, 26, 15, 54, 6, 23409)

In [46]:
dt.now()

datetime.datetime(2021, 10, 26, 15, 54, 31, 599341)

In [50]:
dt1='15-Aug-2019'
type(dt1)

str

In [48]:
dt2=dt.strptime(dt1, '%d-%b-%Y')
dt2

datetime.datetime(2019, 8, 15, 0, 0)

In [49]:
# dd mmmm, yyyy - dddd
dt2.strftime('%d %B, %Y - %A')

'15 August, 2019 - Thursday'

In [51]:
# not applicable on series
dt.strptime(d1, '%d%m%Y')

TypeError: strptime() argument 1 must be str, not Series

In [52]:
print(dir(pd.Timestamp))

['__add__', '__array_priority__', '__class__', '__delattr__', '__dict__', '__dir__', '__doc__', '__eq__', '__format__', '__ge__', '__getattribute__', '__gt__', '__hash__', '__init__', '__init_subclass__', '__le__', '__lt__', '__module__', '__ne__', '__new__', '__pyx_vtable__', '__radd__', '__reduce__', '__reduce_cython__', '__reduce_ex__', '__repr__', '__rsub__', '__setattr__', '__setstate__', '__setstate_cython__', '__sizeof__', '__str__', '__sub__', '__subclasshook__', '__weakref__', '_date_repr', '_repr_base', '_round', '_short_repr', '_time_repr', 'asm8', 'astimezone', 'ceil', 'combine', 'ctime', 'date', 'day', 'day_name', 'dayofweek', 'dayofyear', 'days_in_month', 'daysinmonth', 'dst', 'floor', 'fold', 'freq', 'freqstr', 'fromisoformat', 'fromordinal', 'fromtimestamp', 'hour', 'is_leap_year', 'is_month_end', 'is_month_start', 'is_quarter_end', 'is_quarter_start', 'is_year_end', 'is_year_start', 'isocalendar', 'isoformat', 'isoweekday', 'max', 'microsecond', 'min', 'minute', 'month', 'month_name', 'nanosecond', 'normalize', 'now', 'quarter', 'replace', 'resolution', 'round', 'second', 'strftime', 'strptime', 'time', 'timestamp', 'timetuple', 'timetz', 'to_datetime64', 'to_julian_date', 'to_numpy', 'to_period', 'to_pydatetime', 'today', 'toordinal', 'tz', 'tz_convert', 'tz_localize', 'tzinfo', 'tzname', 'utcfromtimestamp', 'utcnow', 'utcoffset', 'utctimetuple', 'value', 'week', 'weekday', 'weekofyear', 'year']

Common operations on the date and time variables
-----------------------------------------------------------------

1. Get the system date/time
2. Convert the str/object into date and time
3. Convert the date time into some format
4. Subtract two dates
5. Add an integer value to a date

Questions
-----------------------------------------------------------------

1. Convert following dates in to datetime
        d1 = pd.Series(['2309 2012', '0309 2019'])
        d2 = pd.Series(['12:45:55 pm 02232002', '11:40:55 pm 06022002', '12:04:55 am 10302002'])

2. Get your age in no of years

3. Get the course completion date, if course stared on 1 Jul' 2019 and the duraion is 1 month 5 days

4. Display the today's date in given format
    dd-mmm-yy hh:mm
        
5. Display the current dayname e.g. Tuesday, Wednesday

In [54]:
d2

0    12:45:55 pm 02232002
1    11:40:55 pm 06022002
2    12:04:55 am 10302002
dtype: object

In [55]:
# get the last day of the month for all tha dates

pd.to_datetime(d2, format = '%I:%M:%S %p %m%d%Y') + pd.DateOffset(days=7, months = 2, years=-2)

0   2000-04-30 12:45:55
1   2000-08-09 23:40:55
2   2001-01-06 00:04:55
dtype: datetime64[ns]

In [56]:
pd.DateOffset(years = 2)

In [59]:
# 1. Convert following dates in to datetime
pd.to_datetime(d2, format = '%I:%M:%S %p %m%d%Y')

0   2002-02-23 12:45:55
1   2002-06-02 23:40:55
2   2002-10-30 00:04:55
dtype: datetime64[ns]

In [63]:
# 2. Get your age in no of years       '20 Jun 2000'
dob = input('Enter your DOB: (dd mmm yyyy)')
#dob='01 Jan 2000'
current_dt  = pd.Timestamp.today()
print(current_dt.year - dt.strptime(dob, '%d %b %Y').year)

Enter your DOB: (dd mmm yyyy)03 Oct 1997
24

In [64]:
#WITHOUT
dob='01 Jan 2000'
current_dt = pd.Timestamp.today()
print(current_dt.year - dt.strptime(dob, '%d %b %Y').year)

21

In [65]:
dob='01 Jan 2000'
#pd.to_datetime(dob, '%d %b %Y') # Works on pandas series and not on str
dt.strptime(dob, '%d %b %Y')     # Works on str/ object but wont work on series
dt.strptime(dob,'%d %b %Y')  #Pandas analoguos function strptime

datetime.datetime(2000, 1, 1, 0, 0)

In [66]:
# Get the course completion date, if course stared on 1 Jul' 2019 and the duraion is 1 month 5 days
csd = dt.strptime("1 Jul' 2019", "%d %b' %Y") + pd.DateOffset(years = 1, month = 5)
csd

Timestamp('2020-05-01 00:00:00')

In [67]:
d1

0    23-09-2012
1    03-09-2019
dtype: object

In [68]:
pd.to_datetime(d1, format = '%d-%m-%Y') + pd.DateOffset(months = 1, days = 5)

0   2012-10-28
1   2019-10-08
dtype: datetime64[ns]

In [69]:
# leap year
date2 =dt.strptime("29 feb' 2000", "%d %b' %Y") + pd.DateOffset(years = 1)

In [82]:
# 4. Display the today's date in given format [ dd-mmm-yy hh:mm ]
pd.Timestamp.now().strftime('%d-%m-%y %H:%M')
#pd.Timestamp.now().strftime('%A, %d-%b-%Y')

'26-10-21 16:10'

In [71]:
# 5. Display the current dayname e.g. Tuesday, Wednesday
pd.Timestamp.now().strftime('%A')

'Tuesday'